In [73]:
import pandas as pd
import requests #requests bilbiothèque qui permet de collecter le code source d'une page avec un format unitilisable
from bs4 import BeautifulSoup #permet de normaliser le format pour qu'il soit utilisable et selectionnable
import re # pour les expressions régulieres
#selenium

In [ ]:
url = "https://www.avito.ma/fr/maroc/v%C3%A9hicules-%C3%A0_vendre"
page = requests.get(url)
pageSoup = BeautifulSoup(page.content,"html.parser")

In [ ]:
container = pageSoup.find("div",{"class":"sc-1nre5ec-0 gpXkJn listing"})
regex = re.compile('adListCard*')
elements = container.find_all("div",{"data-testid":re.compile(regex)})
prices = []
for element in elements:
    prices.append(element.find("span",{"data-testid":"adPrice"}).get_text())
prices

In [25]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
chipo = pd.read_csv(url, sep = '\t')

In [27]:
pattern = r'\$*'
# Match all digits in the string and replace them with an empty string
function = lambda x:re.sub(pattern, '', x)
chipo["item_price"] = chipo["item_price"].apply(function)
chipo["item_price"] = chipo["item_price"].astype(float)

In [31]:
pattern = r'\$*'

re.sub(pattern, '', "$1$2$")

'12'

In [18]:
import re

#original string
string1 = "9839yak88jkssir1996"

pattern = r'[0-9]'

# Match all digits in the string and replace them with an empty string
new_string = re.sub(pattern, '', string1)

print(new_string)

yakjkssir

In [32]:
chipo

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75

In [38]:
chipo["item_name"].value_counts().keys()

'Chicken Bowl'

['Prix non specifié',
 '123 000 DH',
 'Prix non specifié',
 '109 000 DH',
 '150 000 DH',
 '109 000 DH',
 'Prix non specifié',
 '200 DH',
 'Prix non specifié',
 '85 000 DH',
 'Prix non specifié',
 '135 000 DH',
 '150 000 DH',
 'Prix non specifié',
 '88 000 DH',
 '279 000 DH',
 '85 000 DH',
 '89 000 DH',
 'Prix non specifié',
 '82 000 DH',
 '193 000 DH',
 '195 000 DH',
 '2 000 DH',
 '4 000 DH',
 'Prix non specifié',
 '300 DH',
 '1 650 DH',
 'Prix non specifié',
 'Prix non specifié',
 '149 000 DH',
 'Prix non specifié',
 '150 000 DH',
 '80 000 DH',
 'Prix non specifié',
 '120 000 DH']

In [62]:
s.append(23)

NameError: name 's' is not defined

In [66]:
df = pd.DataFrame({"name":["yassir","driss","jalal"],"age":[26,30,20]},columns=["name","age"])
df.set_index("age")

       name
age
26   yassir
30    driss
20    jalal

In [67]:
df.to_csv("names.csv")

In [72]:
w = pd.read_csv("names.csv",index_col=0)
w

     name  age
0  yassir   26
1   driss   30
2   jalal   20